Информационная_база/src/InformationRegisters/ИдентификаторыСинхронизуемыхОбъектовМП/ИдентификаторыСинхронизуемыхОбъектовМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИдентификаторыСинхронизуемыхОбъектовМП</name>
  <resources>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.СтавкиНДСМП</types>
      <types>CatalogRef.СтруктурныеЕдиницыМП</types>
      <types>CatalogRef.СтатьиМП</types>
      <types>CatalogRef.КассыККММП</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторНаЦентральномУзле</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторНаКлиентскомУзле</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/InformationRegisters/ИдентификаторыСинхронизуемыхОбъектовМП/ManagerModule.bsl
Процедура ДобавитьЗапись(Структура) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИдентификаторыСинхронизуемыхОбъектовМП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ИдентификаторНаКлиентскомУзле.Установить(Структура.ИдентификаторНаКлиентскомУзле);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапсиь = НаборЗаписей.Добавить();
		Для Каждого Элемент Из Структура Цикл
			НоваяЗапсиь[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
		
	Иначе
		Для каждого ЗаписьНабора Из НаборЗаписей Цикл
			Для Каждого Элемент Из Структура Цикл
				ЗаписьНабора[Элемент.Ключ] = Элемент.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	НаборЗаписей.Записать();
	
	
КонецПроцедуры

Функция ПолучитьСсылкуПоУникальномуИдентификаторуНаЦентральномУзле(УникальныйИдентификаторНаЦентральномУзле) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыСинхронизуемыхОбъектовМП.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ИдентификаторыСинхронизуемыхОбъектовМП КАК ИдентификаторыСинхронизуемыхОбъектовМП
		|ГДЕ
		|	ИдентификаторыСинхронизуемыхОбъектовМП.ИдентификаторНаЦентральномУзле = &ИдентификаторНаЦентральномУзле";
	
	Запрос.УстановитьПараметр("ИдентификаторНаЦентральномУзле", УникальныйИдентификаторНаЦентральномУзле);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено
	
КонецФункции // ()
